
HELLO = """👋 Привет! Я — бот-менеджер для магазина.

Чтобы я начал работать, добавь меня в **группу с включёнными темами (топиками)** и выдай права на чтение и отправку сообщений.

📌 После добавления в группу:
- Я автоматически начну отслеживать заказы и сообщения
- Вы сможете управлять магазином через команды прямо в группе"""

USER_INFO = """🛠 Полезная информация:
🔹 Твой Telegram ID: <code>{user_id}</code>
🔹 Chat ID текущего чата: <code>{chat_id}</code>
🔹 Username: <code>@{username}</code>

Если возникнут вопросы — пиши сюда. Я всегда на связи 😊"""

GROUP_HELLO = "📡 Группа распознана.\n"

GROUP_INFO = """Вот полезная информация:
🔹 Chat title: <code>{chat_title}</code>
🔹 Chat ID: <code>{chat_id}</code>
🔹 Chat type: <code>{chat_type}</code>
🔹 Topic (Thread) id: <code>{thread_id_info}</code>"""
